lvx/base/BusinessProcesses/бит_Процесс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<BusinessProcess>
		<Properties>
			<Name>бит_Процесс</Name>
			<BasedOn>
				<xr:Item>Catalog.бит_АлгоритмыПроцессов</xr:Item>
			</BasedOn>
			<Task>Task.бит_Задача</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АлгоритмыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Comment>Состояние</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедущаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТочкиАлгоритмов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Comment>Основание</Comment>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.бит_Процесс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Режим</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РежимыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимАдресацииАвтоматическихЗадач</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РежимыАдресацииАвтоматическихЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцессОснование</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.бит_Процесс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение_УУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение_МУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение_Бюдж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыПроцесса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрТип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

lvx/base/InformationRegisters/бит_НеактивныеЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НеактивныеЗадачи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>НеактивнаяЗадача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.бит_Задача</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/BusinessProcesses/бит_Процесс/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс
	
// Функция определяет есть ли невыполненные задачи или нет. 
// 
// Параметры:
//  Процесс    - БизнесПроцессСсылка.бит_Процесс
//  Исключения - Массив.
// 
// Возвращаемое значение:
//  Булево
// 
Функция ЕстьНевыполненныеЗадачи(Процесс, Исключения = Неопределено) Экспорт

	флЕсть = Ложь;
				   
	Запрос = Новый Запрос;
	
	Запрос.Текст =  "ВЫБРАТЬ
	|	бит_Задача.Ссылка КАК Задача
	|ИЗ
	|	Задача.бит_Задача КАК бит_Задача
	|ГДЕ
	|	бит_Задача.БизнесПроцесс = &БизнесПроцесс
	|	И (НЕ бит_Задача.Выполнена)
	|	%Исключения%";
					
					
	Запрос.УстановитьПараметр("БизнесПроцесс" , Процесс);
	Если ТипЗнч(Исключения) = Тип("Массив") Тогда
		
		Запрос.УстановитьПараметр("Исключения", Исключения);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Исключения%", "И (НЕ бит_Задача.Ссылка В (&Исключения))");
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Исключения%","");
	
	КонецЕсли; 					
				   
	Результат = Запрос.Выполнить();
	
	флЕсть = НЕ Результат.Пустой();
	
	Возврат флЕсть;
	
КонецФункции // ЕстьНевыполненныеЗадачи()

// Функция возвращает таблицу задач по процессу.
// 
// Параметры:
//  Процесс - БизнесПроцессСсылка.бит_Процесс,
//  ТолькоВыполненные - Булево, Неопределено.
// 
// Возвращаемое значение:
//  ТаблицаЗначений.
// 
Функция ПолучитьЗадачиПроцесса(Процесс, ТолькоВыполненные = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Процесс) Тогда
		Возврат НовоеОписаниеЗадачПоПроцессу();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Процесс"  , Процесс);
	Запрос.УстановитьПараметр("Выполнена", ТолькоВыполненные);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Задачи.Ссылка КАК Задача,
	|	Задачи.ТочкаАлгоритма КАК Точка,
	|	Задачи.Состояние КАК Состояние,
	|	Задачи.СрокИсполнения КАК СрокИсполнения,
	|	Задачи.Предмет КАК Предмет
	|ИЗ
	|	Задача.бит_Задача КАК Задачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НеактивныеЗадачи КАК НеактивныеЗадачи
	|		ПО Задачи.Ссылка = НеактивныеЗадачи.НеактивнаяЗадача
	|ГДЕ
	|	Задачи.БизнесПроцесс = &Процесс
	|	И НеактивныеЗадачи.НеактивнаяЗадача ЕСТЬ NULL
	|	И &ПроверкаВыполнения";
	
	ТекстПроверкиВыполнения = "ИСТИНА";
	Если ТолькоВыполненные <> Неопределено Тогда
		ТекстПроверкиВыполнения = "Задачи.Выполнена = &Выполнена";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПроверкаВыполнения", ТекстПроверкиВыполнения);
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция возвращает структуру с параметрами процесса.
// 
// Параметры:
//  Процесс - БизнесПроцессСсылка.бит_Процесс.
// 
// Возвращаемое значение:
//  Структура.
// 
Функция ПолучитьПараметрыПроцесса(Процесс)  Экспорт
	
	ПарамПроцесса = Новый Структура;
	Для каждого СтрокаТаблицы Из Процесс.ПараметрыПроцесса Цикл		
		ПарамПроцесса.Вставить(СтрокаТаблицы.Имя, СтрокаТаблицы.Значение);		
	КонецЦикла; 
	
	Возврат ПарамПроцесса;
	
КонецФункции // ПолучитьПараметрыПроцесса()

// Функция возвращает значение параметра процесса. Значение извлекается из структуры ПараметрыПроцесса 
// или из строки с настройкой параметров, если параметр указан явно.
// 
// Параметры:
//  НастройкаЗаполненияПарамета - Произвольный - Должен содержать атрибут "Значение"
//  ПараметрыПроцесса 			- Структура.
// 
// Возвращаемое значение:
//  Произвольный.
// 
Функция ПолучитьЗначениеПараметраПроцесса(НастройкаЗаполненияПарамета, ПараметрыПроцесса) Экспорт
	
	Если ТипЗнч(НастройкаЗаполненияПарамета.Значение) = Тип("Строка") И Найти(НастройкаЗаполненияПарамета.Значение,"#ПП.") Тогда
		
		ТекЗначение = Неопределено;
		ИмяПараметра = СтрЗаменить(НастройкаЗаполненияПарамета.Значение, "#ПП.","");
		ПараметрыПроцесса.Свойство(ИмяПараметра, ТекЗначение);
		
	Иначе	
		
		ТекЗначение = НастройкаЗаполненияПарамета.Значение;
		
	КонецЕсли; 
	
	Возврат ТекЗначение;
	
КонецФункции // ПолучитьЗначениеПараметраПроцесса()

// Процедура выполняет остановку процесса, подчиненных процессов и задач процесса.
// 
// Параметры:
//  Процесс 	   - БизнесПроцессСсылка.бит_Процесс
//  РежимСообщений - Строка.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ОстановитьПроцесс(Процесс, РежимСообщений = "Ошибки") Экспорт
	
	ЗаписанПроцесс = Ложь;
	
	// Остановка процесса.
	Если Процесс.Состояние = Справочники.бит_СтатусыОбъектов.Процесс_Активный Тогда
		
		ПроцОбъект = Процесс.ПолучитьОбъект();
		ПроцОбъект.ДополнительныеСвойства.Вставить("Остановить");
		
		ЗаписанПроцесс = бит_ОбщегоНазначения.ЗаписатьБизнесПроцесс(ПроцОбъект, РежимСообщений);
		
	КонецЕсли; 
	
	Возврат ЗаписанПроцесс;
	
КонецФункции // ОстановитьПроцесс()

// Функция выполняет остановку задач процесса.
// 
// Параметры:
//  Процесс - БизнесПроцессСсылка.бит_Процесс
//  РежимСообщений - Строка.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ОстановитьЗадачиПроцесса(Процесс, РежимСообщений = "Ошибки") Экспорт
		
	// Остановка задач.
	МассивСостояний = Новый Массив;
	МассивСостояний.Добавить(Справочники.бит_СтатусыОбъектов.Задача_Создана);
	МассивСостояний.Добавить(Справочники.бит_СтатусыОбъектов.Задача_Принята);
	МассивСостояний.Добавить(Справочники.бит_СтатусыОбъектов.Задача_Просрочена);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Процесс", Процесс);
	Запрос.УстановитьПараметр("МассивСостояний", МассивСостояний);
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_Задача.Ссылка КАК Задача
	|ИЗ
	|	Задача.бит_Задача КАК бит_Задача
	|ГДЕ
	|	бит_Задача.БизнесПроцесс = &Процесс
	|	И бит_Задача.Состояние В(&МассивСостояний)";
	
	Результат = Запрос.Выполнить();
	
	МассивЗадач = Результат.Выгрузить().ВыгрузитьКолонку("Задача");
	
	ЗадачаОстановлена = Задачи.бит_Задача.Остановить(МассивЗадач, Ложь, РежимСообщений);
		
	Возврат ЗадачаОстановлена;
	
КонецФункции // ОстановитьЗадачиПроцесса()

// Функция возвобновляет выполнение процесса, вложенных процессов и задач после остановки.
// 
// Параметры:
//  Процесс - БизнесПроцессСсылка.бит_Процесс
//  РежимСообщений - Строка.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ПродолжитьПроцесс(Процесс, РежимСообщений = "Ошибки") Экспорт

	ЗаписанБизнесПроцесс = Ложь;
	
	Если Процесс.Состояние = Справочники.бит_СтатусыОбъектов.Процесс_Остановлен Тогда
		
		ПроцОбъект = Процесс.ПолучитьОбъект();
		ПроцОбъект.ДополнительныеСвойства.Вставить("Продолжить");
		
		ЗаписанБизнесПроцесс = бит_ОбщегоНазначения.ЗаписатьБизнесПроцесс(ПроцОбъект, РежимСообщений);
		
	КонецЕсли; 
	
	Возврат ЗаписанБизнесПроцесс;
	
КонецФункции // ПродолжитьПроцесс()

// Функция возобновляет выполнение задач процесса после остановки.
// 
// Параметры:
//  Процесс 	   - БизнесПроцессСсылка.бит_Процесс
//  РежимСообщений - Строка.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ПродолжитьЗадачиПроцесса(Процесс, РежимСообщений = "Ошибки")  Экспорт
	
	// Продолжение задач.
	МассивСостояний = Новый Массив;
	МассивСостояний.Добавить(Справочники.бит_СтатусыОбъектов.Задача_Остановлена);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Процесс", Процесс);
	Запрос.УстановитьПараметр("МассивСостояний", МассивСостояний);
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_Задача.Ссылка КАК Задача
	               |ИЗ
	               |	Задача.бит_Задача КАК бит_Задача
	               |ГДЕ
	               |	бит_Задача.БизнесПроцесс = &Процесс
	               |	И бит_Задача.Состояние В(&МассивСостояний)";
	
	Результат = Запрос.Выполнить();
	
	МассивЗадач = Результат.Выгрузить().ВыгрузитьКолонку("Задача");
	
	ПродолжитьВыполнение = Задачи.бит_Задача.ПродолжитьВыполнение(МассивЗадач, Ложь, РежимСообщений);
		
	Возврат ПродолжитьВыполнение;
	
КонецФункции // ПродолжитьЗадачиПроцесса()

// Процедура заполяет массив ФормируемыеЗадачи, объектами задач, которые необходимо создать.
// 
// Параметры:
//  Процесс 		  - БизнесПроцессОбъект.бит_Процесс
//  ФормируемыеЗадачи - Массив.
// 
Процедура СоздатьЗадачиПроцесса(Процесс, ФормируемыеЗадачи) Экспорт
	
	 // Вызов выполнения алгоритма, для определения точек, по которым необходимо создать задачи.
	 КомментироватьВыполнение = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("КомментироватьХодВыполненияАлгоритмовПроцессов",
																Пользователи.ТекущийПользователь());
	 
	 РежимСообщений = ?(КомментироватьВыполнение, "Все", "Ошибки");			
	 
	 ТабЗадачи = БизнесПроцессы.бит_Процесс.ПолучитьЗадачиПроцесса(Процесс.Ссылка);
	 МаксКоличествоОбъектов = бит_УправлениеПроцессами.МаксимальноеКоличествоОбъектовАдресации();
	 
	 СтруктураКонтекст = Новый Структура;
	 СтруктураКонтекст.Вставить("ТекущийОбъект"			  , Процесс);
	 СтруктураКонтекст.Вставить("ТабЗадачи"				  , ТабЗадачи);
	 СтруктураКонтекст.Вставить("ПользовательскиеДействия", Новый Массив);
	 
	 бит_УправлениеПроцессами.ВыполнитьАлгоритм(Процесс.Алгоритм, СтруктураКонтекст, РежимСообщений);
	 
	 Если СтруктураКонтекст.ПользовательскиеДействия.Количество() > 0 Тогда
		 
		 ПарамПроцесса = Новый Структура;
		 Для каждого СтрокаТаблицы Из Процесс.ПараметрыПроцесса Цикл
		 	ПарамПроцесса.Вставить(СтрокаТаблицы.Имя, СтрокаТаблицы.Значение);
		 КонецЦикла; 
		 
		 ЕстьДинамическиеПараметры = Справочники.бит_АлгоритмыПроцессов.ЕстьДинамическиеПараметры(Процесс.Алгоритм);
		 Для каждого СтрТочкаДействие Из СтруктураКонтекст.ПользовательскиеДействия Цикл
			 
			 // Параметры для действия.  
			 ПарамДляДействия = Новый Структура;
			 Для каждого КиЗ Из ПарамПроцесса Цикл
			 	ПарамДляДействия.Вставить(КиЗ.Ключ, КиЗ.Значение);
			 КонецЦикла; 
			 
			 // Получение динамических параметров из точки.
			 ПарамДинамические = Новый Структура;
			 Если ЕстьДинамическиеПараметры Тогда
			 	 Для каждого СтрокаТаблицы Из СтрТочкаДействие.Точка.ПараметрыПроцесса Цикл
				 	 ПарамДинамические.Вставить(СтрокаТаблицы.Имя, СтрокаТаблицы.Значение);
				 КонецЦикла; 
			 КонецЕсли; 
			 
			 // Переопределяем динамическими параметрами параметры процесса.
			 Для каждого КиЗ Из ПарамДинамические Цикл
			 	Если ПарамДляДействия.Свойство(КиЗ.Ключ) И ЗначениеЗаполнено(КиЗ.Ключ) Тогда
					 ПарамДляДействия[КиЗ.Ключ] = КиЗ.Значение;
				КонецЕсли; 
			 КонецЦикла; 
			 
			 КонтекстДействия = Новый Структура;
			 КонтекстДействия.Вставить("ЗадачаОбъект"		   , Неопределено);
			 КонтекстДействия.Вставить("МаксКоличествоОбъектов", МаксКоличествоОбъектов);
			 КонтекстДействия.Вставить("ПараметрыПроцесса"	   , ПарамДляДействия);
			 КонтекстДействия.Вставить("Процесс"			   , Процесс.Ссылка);
		 	 бит_УправлениеПроцессами.ВыполнитьПользовательскоеДействие(СтрТочкаДействие.Действие, КонтекстДействия, СтрТочкаДействие.Точка, , РежимСообщений);
			 
			 Если ТипЗнч(КонтекстДействия.ЗадачаОбъект) = Тип("ЗадачаОбъект.бит_Задача") Тогда
				  КонтекстДействия.ЗадачаОбъект.БизнесПроцесс = Процесс.Ссылка;
				  КонтекстДействия.ЗадачаОбъект.ТочкаМаршрута = БизнесПроцессы.бит_Процесс.ТочкиМаршрута.ВыполнениеДействий;
			 	  ФормируемыеЗадачи.Добавить(КонтекстДействия.ЗадачаОбъект);
			 КонецЕсли;
		 КонецЦикла; 
	 Иначе	
		 
		 // Завершить процесс
		 
	 КонецЕсли; 
	
КонецПроцедуры

// Процедура заполяет процесс по алгоритму.
// 
// Параметры:
//  Процесс  - СправочникСсылка.бит_АлгоритмыПроцессов
//  Алгоритм - Массив.
// 
Процедура ЗаполнитьПоАлгоритму(Процесс, Алгоритм) Экспорт
	
	Результат = Справочники.бит_АлгоритмыПроцессов.АлгоритмГотовКРаботе(Алгоритм);
	Если НЕ Результат Тогда
		ВызватьИсключение НСтр("ru='Алгоритм не готов к использованию.';
							   |en='The algorithm is not ready for use.'");
	КонецЕсли;
	
	Реквизиты = "Наименование, ВидАлгоритма, Назначение_УУ, Назначение_МУ, Назначение_Бюдж, ПараметрыАлгоритма";
	РеквизитыАлгоритма = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Алгоритм, Реквизиты);
	
	Если РеквизитыАлгоритма.ВидАлгоритма <> Перечисления.бит_ВидыАлгоритмов.Прочее Тогда
		ВызватьИсключение НСтр("ru='Необходимо выбрать алгоритм произвольного процесса.';
							   |en='You must select an arbitrary algorithm process.'");
	КонецЕсли;  
	
	Процесс.Алгоритм 		= Алгоритм; 
	Процесс.Назначение_УУ   = РеквизитыАлгоритма.Назначение_УУ;
	Процесс.Назначение_МУ   = РеквизитыАлгоритма.Назначение_МУ;
	Процесс.Назначение_Бюдж = РеквизитыАлгоритма.Назначение_Бюдж;
	Процесс.Наименование    = РеквизитыАлгоритма.Наименование;
	
	Процесс.ПараметрыПроцесса.Очистить();
	ПараметрыАлгоритма = РеквизитыАлгоритма.ПараметрыАлгоритма.Выбрать();
	Пока ПараметрыАлгоритма.Следующий() Цикл
		НоваяСтрока = Процесс.ПараметрыПроцесса.Добавить();
		НоваяСтрока.Имя          = ПараметрыАлгоритма.Имя;
		НоваяСтрока.СтрТип       = ПараметрыАлгоритма.СтрТип;
		НоваяСтрока.Значение     = ПараметрыАлгоритма.ЗначениеПоУмолчанию;
		НоваяСтрока.Обязательный = ПараметрыАлгоритма.Обязательный И НЕ ПараметрыАлгоритма.Динамический;
	КонецЦикла; 

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовоеОписаниеЗадачПоПроцессу()
	
	ОписаниеЗадач = Новый ТаблицаЗначений;
	ОписаниеЗадач.Колонки.Добавить("Задача", Новый ОписаниеТипов("ЗадачаСсылка.бит_Задача"));
	ОписаниеЗадач.Колонки.Добавить("Точка", Новый ОписаниеТипов("СправочникСсылка.бит_ТочкиАлгоритмов"));
	ОписаниеЗадач.Колонки.Добавить("Состояние", Новый ОписаниеТипов("СправочникСсылка.бит_СтатусыОбъектов"));
	ОписаниеЗадач.Колонки.Добавить("СрокИсполнения", Новый ОписаниеТипов("Дата", , ,
													 Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ОписаниеЗадач.Колонки.Добавить("Предмет");
	
	Возврат ОписаниеЗадач;
	
КонецФункции

#КонецОбласти

#КонецЕсли
